/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.5.40 : Database - gas
*********************************************************************
方圆最帅！！！
QQ：1057072154
*/


/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`gas` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `gas`;

/*Table structure for table `calendar` */

DROP TABLE IF EXISTS `calendar`;

CREATE TABLE `calendar` (
  `cid` int(11) NOT NULL AUTO_INCREMENT,
  `start` datetime DEFAULT NULL,
  `end` datetime DEFAULT NULL,
  `title` varchar(50) DEFAULT NULL,
  `classname` varchar(19) DEFAULT 'info',
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

/*Data for the table `calendar` */

insert  into `calendar`(`cid`,`start`,`end`,`title`,`classname`) values (2,'2020-04-18 09:53:49','2020-04-18 09:53:49','事件1','danger'),(5,'2020-04-18 14:53:01','2020-04-18 14:53:01','事件2','info'),(6,'2020-04-18 14:53:14','2020-04-18 14:53:14','事件3','info'),(7,'2020-04-18 00:00:00','2020-04-19 00:00:00','事件4','info'),(8,'2020-04-18 00:00:00','2020-04-19 00:00:00','事件5','info'),(13,'2020-04-05 12:14:00','2020-04-07 12:20:00','事件6','info'),(14,'2020-04-08 18:58:00','2020-04-30 18:58:00','事件7','info'),(15,'2020-04-08 18:58:00','2020-04-30 18:58:00','事件8','info'),(17,'2020-03-31 21:25:00','2020-04-01 21:25:00','事件9','info'),(18,'2020-04-01 13:20:00','2020-04-02 13:20:00','事件10','info'),(19,'2020-04-01 15:39:00','2020-04-02 15:39:00','事件11','info'),(20,'2020-04-03 15:43:00','2020-04-04 15:43:00','事件12','info'),(21,'2020-04-04 15:51:00','2020-04-05 15:51:00','事件13','yellow'),(23,'2020-05-10 20:58:00','2020-05-10 20:58:00','今天电脑硬盘坏了','danger'),(24,'2020-05-09 20:58:00','2020-05-09 20:58:00','事件14','info');

/*Table structure for table `cylinder` */

DROP TABLE IF EXISTS `cylinder`;

CREATE TABLE `cylinder` (
  `id` int(5) NOT NULL AUTO_INCREMENT,
  `kind` varchar(16) DEFAULT NULL,
  `state` tinyint(1) DEFAULT NULL,
  `manufacturer` varchar(20) DEFAULT NULL,
  `area` varchar(20) DEFAULT NULL,
  `createtime` datetime DEFAULT NULL,
  `jointime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `operator` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=97 DEFAULT CHARSET=utf8;

/*Data for the table `cylinder` */

insert  into `cylinder`(`id`,`kind`,`state`,`manufacturer`,`area`,`createtime`,`jointime`,`operator`) values (1,'氧气',1,'制造商A','河南','2018-12-01 20:18:10','2020-04-19 20:27:52','admin'),(2,'液化天然气',0,'制造商A','河南','2019-02-01 20:18:25','2020-04-19 20:27:52','admin'),(3,'压缩天然气',1,'制造商A','河南','2019-12-31 20:18:32','2020-04-19 20:27:52','admin'),(4,'液氯',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','lisi'),(5,'甲烷',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','admin'),(6,'氢气',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','admin'),(7,'氧气',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(8,'液化石油气',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(9,'氯乙烯',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(10,'液氦',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(16,'液氦',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 22:09:12','lisi'),(17,'液氦',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 22:09:14','fangyuan'),(18,'液氦',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 22:09:16','admin'),(19,'液化石油气',0,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:32:50','admin'),(20,'氢气',0,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:33:25','fangyuan'),(22,'氧气',1,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:35:56','fangyuan'),(23,'氧气',0,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:36:30','fangyuan'),(24,'氧气',1,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:36:37','fangyuan'),(25,'氧气',1,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:36:55','fangyuan'),(26,'氧气',0,'制造商B','北京','2018-11-01 20:18:39','2020-04-19 22:41:27','fangyuan'),(28,'压缩天然气',0,'制造商A','河南','2019-12-31 20:18:32','2020-04-19 20:27:52','admin'),(29,'液氨',1,'制造商B','北京','2018-11-01 20:18:39','2020-04-21 17:57:34','fangyuan'),(30,'压缩天然气',0,'制造商B','北京','2018-11-01 20:18:39','2020-04-21 18:18:06','fangyuan'),(31,'压缩天然气',0,'制造商B','北京','1979-09-05 02:05:00','2020-04-21 18:25:33','fangyuan'),(32,'压缩天然气',0,'制造商B','北京','1979-09-05 02:05:07','2020-04-21 18:26:45','fangyuan'),(33,'压缩天然气',0,'制造商B','北京','1979-09-28 16:50:07','2020-04-21 18:27:01','fangyuan'),(35,'液氯',0,'制造商B','北京','2020-04-07 07:00:56','2020-04-22 11:33:11','fangyuan'),(39,'液氨',0,'制造商A','北京','2018-12-01 20:18:10','2020-04-19 20:27:52','fangyuan'),(40,'液化天然气',1,'制造商A','河南','2019-02-01 20:18:25','2020-04-19 20:27:52','admin'),(41,'压缩天然气',0,'制造商A','河南','2019-12-31 20:18:32','2020-04-19 20:27:52','admin'),(42,'液氯',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','lisi'),(43,'甲烷',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','admin'),(44,'氢气',0,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','admin'),(45,'氧气',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(46,'液化石油气',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(47,'氯乙烯',1,'制造商A','河南','2018-11-01 20:18:39','2020-04-19 20:27:52','fangyuan'),(48,'氧气',0,'北京','北京','2018-11-01 20:18:39','2020-04-19 22:36:37','fangyuan'),(49,'氧气',0,'北京','北京','2018-11-01 20:18:39','2020-04-19 22:36:30','fangyuan'),(52,'氧气',1,'北京','北京','2018-11-01 20:18:39','2020-04-19 22:36:30','fangyuan'),(53,'氧气',1,'北京','北京','2018-11-01 20:18:39','2020-04-19 22:36:30','fangyuan'),(54,'液氨',0,'制造商B','北京','2020-04-09 08:25:16','2020-04-24 13:19:27','admin'),(55,'液化天然气',0,'洛阳博轩制造商','河南省洛阳市','2020-01-08 02:05:58','2020-05-10 19:15:37','admin'),(56,'甲烷',0,'洛阳博轩制造商','河南省洛阳市','2020-03-05 09:30:01','2020-05-10 19:17:16','admin'),(57,'甲烷',1,'郑州洪磊制造商','郑州','2020-05-04 15:10:00','2020-05-10 20:43:52','admin'),(58,'甲烷',0,'郑州洪磊制造商','郑州','2020-05-04 15:10:00','2020-05-10 20:43:52','admin'),(59,'液化石油气',1,'郑州洪磊制造商','郑州','2020-05-04 15:10:00','2020-05-10 20:43:52','admin'),(60,'液化天然气',1,'郑州洪磊制造商','郑州','2020-05-04 15:10:00','2020-05-10 20:43:52','admin'),(61,'氯乙烯',0,'郑州洪磊制造商','郑州','2020-05-04 15:10:00','2020-05-10 20:43:52','admin'),(62,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(63,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(64,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(65,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(66,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(67,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(68,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:00:33','admin'),(69,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(70,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(71,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(72,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(73,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(74,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(75,'液氨',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:05:30','admin'),(76,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:08:38','admin'),(77,'氧气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:08:38','admin'),(78,'氧气',1,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:08:38','admin'),(79,'液氨',1,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-05-31 22:08:38','admin'),(90,'液化天然气',1,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin'),(91,'液化天然气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin'),(92,'液化天然气',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin'),(93,'甲烷',1,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin'),(94,'甲烷',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin'),(95,'甲烷',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin'),(96,'甲烷',0,'洛阳嘉艺','河南省洛阳市','2020-01-09 20:20:50','2020-06-01 17:08:18','admin');

/*Table structure for table `emp` */

DROP TABLE IF EXISTS `emp`;

CREATE TABLE `emp` (
  `eid` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `sex` varchar(4) DEFAULT NULL,
  `phone` varchar(13) DEFAULT NULL,
  `address` varchar(50) NOT NULL DEFAULT '河南省洛阳市',
  `jointime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`eid`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

/*Data for the table `emp` */

insert  into `emp`(`eid`,`name`,`age`,`sex`,`phone`,`address`,`jointime`) values (1,'张三',18,'男','123456789','河南省洛阳市','2020-04-16 17:37:04'),(2,'李四',20,'女','789456123','河南省洛阳市','2020-04-16 17:38:05'),(4,'李四',20,'女','789456123','河南省洛阳市','2020-04-16 17:38:05'),(5,'张三',18,'男','123456789','河南省洛阳市','2020-04-16 17:37:04'),(7,'张三',18,'男','123456789','河南省洛阳市','2020-04-16 17:37:04'),(8,'李四',20,'女','789456123','河南省洛阳市','2020-04-16 17:38:05'),(9,'张三',80,'男','123456789','河南省洛阳市','2020-05-31 21:58:46'),(10,'李四',20,'男','1111111111','广西','2020-04-17 16:11:24'),(13,'张三',18,'男','123456789','河南省洛阳市','2020-04-16 17:37:04'),(14,'李四',20,'女','789456123','河南省洛阳市','2020-04-16 17:38:05'),(16,'方圆',18,'男','1111111111','河南省洛阳市','2020-04-17 19:58:12'),(17,'方圆',18,'男','1111111111','河南省洛阳市','2020-04-18 20:03:45'),(18,'fangyuan',80,'男','789456','河南省洛阳市','2020-05-31 21:59:12');

/*Table structure for table `log` */

DROP TABLE IF EXISTS `log`;

CREATE TABLE `log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ltable` varchar(20) DEFAULT NULL,
  `ltype` varchar(20) DEFAULT NULL,
  `lname` varchar(30) DEFAULT NULL,
  `loperator` varchar(20) DEFAULT NULL,
  `ltime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `lclientIp` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=77 DEFAULT CHARSET=utf8;

/*Data for the table `log` */

insert  into `log`(`id`,`ltable`,`ltype`,`lname`,`loperator`,`ltime`,`lclientIp`) values (1,'员工表','添加','张三','admin','2020-04-23 20:47:58','192.168.0.102'),(2,'员工表','添加','张三','admin','2020-04-23 20:32:32','192.168.0.102'),(3,'员工表','添加','张三','admin','2020-04-24 15:45:28','192.168.0.102'),(4,'用户表','添加','1234','fangyuan','2020-04-24 16:09:16','192.168.0.102'),(5,'用户表','删除','1234','admin','2020-04-24 16:09:16','192.168.0.102'),(6,'用户表','修改','admin','admin','2020-04-24 16:09:17','192.168.0.102'),(7,'日历日程表','删除','66666','admin','2020-04-24 16:09:18','192.168.0.102'),(8,'员工表','删除','李四','admin','2020-04-24 16:09:19','192.168.0.102'),(9,'气瓶存储','修改','氧气','admin','2020-04-24 16:09:19','192.168.0.102'),(10,'气瓶存储','入库','液氨','admin','2020-04-24 16:09:23','192.168.0.102'),(11,'气瓶存储','批量送去加气','氧气等4个','admin','2020-04-24 16:09:24','192.168.0.102'),(12,'气瓶存储','送去加气','液氨','admin','2020-04-24 16:09:28','192.168.0.102'),(13,'登录','用户登录','admin','admin','2020-05-10 19:02:22','192.168.0.101'),(14,'登录','用户登录','admin','admin','2020-05-10 19:02:49','192.168.0.101'),(15,'登录','用户登录','admin','admin','2020-05-10 19:05:11','192.168.0.101'),(16,'气瓶存储','入库','液化天然气','admin','2020-05-10 19:15:37','192.168.0.101'),(17,'气瓶存储','入库','甲烷','admin','2020-05-10 19:17:16','192.168.0.101'),(18,'登录','用户登录','admin','admin','2020-05-10 19:41:44','192.168.0.101'),(19,'登录','用户登录','admin','admin','2020-05-10 19:51:25','192.168.0.101'),(20,'登录','用户登录','admin','admin','2020-05-10 19:58:32','192.168.0.101'),(21,'登录','用户登录','admin','admin','2020-05-10 20:19:34','192.168.0.101'),(22,'登录','用户登录','admin','admin','2020-05-10 20:22:12','192.168.0.101'),(23,'登录','用户登录','admin','admin','2020-05-10 20:26:32','192.168.0.101'),(24,'登录','用户登录','admin','admin','2020-05-10 20:34:09','192.168.0.101'),(25,'登录','用户登录','admin','admin','2020-05-10 20:35:57','192.168.0.101'),(26,'登录','用户登录','admin','admin','2020-05-10 20:36:51','192.168.0.101'),(27,'气瓶存储','excel批量入库','excel表格入库5个','admin','2020-05-10 20:43:52','192.168.0.101'),(28,'登录','用户登录','lisi','lisi','2020-05-10 20:46:57','192.168.0.101'),(29,'用户表','修改','lisi','lisi','2020-05-10 20:47:15','192.168.0.101'),(30,'登录','用户登录','lisi','lisi','2020-05-10 20:47:27','192.168.0.101'),(31,'日历日程表','添加','今天电脑硬盘坏了','lisi','2020-05-10 20:58:01','192.168.0.101'),(32,'日历日程表','删除','今天电脑硬盘坏了','lisi','2020-05-10 20:58:15','192.168.0.101'),(33,'日历日程表','添加','今天电脑硬盘坏了','lisi','2020-05-10 20:58:25','192.168.0.101'),(34,'日历日程表','添加','默认事件2','lisi','2020-05-10 21:00:23','192.168.0.101'),(35,'登录','用户登录','admin','admin','2020-05-10 21:00:38','192.168.0.101'),(36,'登录','用户登录','admin','admin','2020-05-14 18:04:13','192.168.52.1'),(37,'用户表','添加','wangwu','admin','2020-05-14 18:04:47','192.168.52.1'),(38,'用户表','删除','wangwu','admin','2020-05-14 18:06:02','192.168.52.1'),(39,'用户表','添加','wangwu','admin','2020-05-14 18:06:17','192.168.52.1'),(40,'登录','用户登录','wangwu','wangwu','2020-05-14 18:06:27','192.168.52.1'),(41,'登录','用户登录','admin','admin','2020-05-29 13:31:55','192.168.52.1'),(42,'登录','用户登录','admin','admin','2020-05-29 13:36:23','192.168.52.1'),(43,'气瓶存储','修改为','液化石油气','admin','2020-05-29 13:38:08','192.168.52.1'),(44,'登录','用户登录','admin','admin','2020-05-29 16:39:47','192.168.52.1'),(45,'登录','用户登录','admin','admin','2020-05-29 19:39:50','192.168.52.1'),(46,'登录','用户登录','admin','admin','2020-05-31 21:23:09','192.168.52.1'),(47,'登录','用户登录','admin','admin','2020-05-31 21:54:46','192.168.52.1'),(48,'登录','用户登录','lisi','lisi','2020-05-31 21:57:00','192.168.52.1'),(49,'登录','用户登录','admin','admin','2020-05-31 21:57:24','192.168.52.1'),(50,'登录','用户登录','admin','admin','2020-05-31 21:58:27','192.168.52.1'),(51,'员工表','修改','张三','admin','2020-05-31 21:58:46','192.168.52.1'),(52,'员工表','添加','fangyuan','admin','2020-05-31 21:59:12','192.168.52.1'),(53,'员工表','删除','王培毅是傻逼','admin','2020-05-31 21:59:19','192.168.52.1'),(54,'气瓶存储','excel批量入库','excel表格入库7个','admin','2020-05-31 22:00:33','192.168.52.1'),(55,'登录','用户登录','admin','admin','2020-05-31 22:03:00','192.168.52.1'),(56,'登录','用户登录','admin','admin','2020-05-31 22:04:33','192.168.52.1'),(57,'气瓶存储','excel批量入库','excel表格入库7个','admin','2020-05-31 22:05:30','192.168.52.1'),(58,'登录','用户登录','admin','admin','2020-05-31 22:06:36','192.168.52.1'),(59,'用户表','添加','qwe','admin','2020-05-31 22:07:18','192.168.52.1'),(60,'气瓶存储','excel批量入库','excel表格入库7个','admin','2020-05-31 22:08:38','192.168.52.1'),(61,'登录','用户登录','admin','admin','2020-06-01 16:54:22','192.168.52.1'),(63,'用户表','删除','qqq','admin','2020-06-01 16:56:41','192.168.52.1'),(64,'登录','用户登录','admin','admin','2020-06-01 17:01:33','192.168.52.1'),(65,'气瓶存储','excel批量入库','excel表格入库7个','admin','2020-06-01 17:02:31','192.168.52.1'),(66,'气瓶存储','批量送去充气','液化天然气等4个','admin','2020-06-01 17:03:09','192.168.52.1'),(67,'气瓶存储','批量送去充气','氧气等6个','admin','2020-06-01 17:03:13','192.168.52.1'),(68,'气瓶存储','批量送气','甲烷等4个','admin','2020-06-01 17:03:21','192.168.52.1'),(69,'气瓶存储','批量送气','液氨等6个','admin','2020-06-01 17:03:26','192.168.52.1'),(70,'登录','用户登录','admin','admin','2020-06-01 17:06:01','192.168.52.1'),(71,'登录','用户登录','admin','admin','2020-06-01 17:07:45','192.168.52.1'),(72,'气瓶存储','excel批量入库','excel表格入库7个','admin','2020-06-01 17:08:18','192.168.52.1'),(73,'用户表','添加','qqq','admin','2020-06-01 17:08:51','192.168.52.1'),(74,'气瓶存储','批量送去充气','氧气等3个','admin','2020-06-01 17:10:24','192.168.52.1'),(75,'登录','用户登录','admin','admin','2020-06-01 18:12:28','192.168.52.1'),(76,'登录','用户登录','admin','admin','2020-06-01 18:15:45','192.168.52.1');

/*Table structure for table `picture` */

DROP TABLE IF EXISTS `picture`;

CREATE TABLE `picture` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `src` varchar(150) NOT NULL,
  `title` varchar(20) DEFAULT NULL,
  `absolute` varchar(150) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;

/*Data for the table `picture` */

insert  into `picture`(`id`,`src`,`title`,`absolute`) values (1,'a1.jpg','头像1','localhost:8080/gas/static/img/picture/a1.jpg'),(2,'a2.jpg','头像2','localhost:8080/gas/static/img/picture/a2.jpg'),(3,'a3.jpg','头像3','localhost:8080/gas/static/img/picture/a3.jpg'),(4,'a4.jpg','头像4','localhost:8080/gas/static/img/picture/a4.jpg'),(5,'a5.jpg','头像5','localhost:8080/gas/static/img/picture/a5.jpg'),(6,'a6.jpg','头像6','localhost:8080/gas/static/img/picture/a6.jpg'),(7,'a7.jpg','头像7','localhost:8080/gas/static/img/picture/a7.jpg'),(8,'a8.jpg','头像8','localhost:8080/gas/static/img/picture/a8.jpg'),(9,'a9.jpg','头像9','localhost:8080/gas/static/img/picture/a9.jpg\r\n'),(11,'eee.png','头像10','localhost:8080/gas/static/img/picture/eee.png'),(14,'a13.jpg','头像11','localhost:8080/gas/static/img/picture/a13.jpg'),(17,'414kiu.jpg','头像12','localhost:8080/gas/static/img/picture/414kiu.jpg'),(20,'1590934064829_11.jpg','头像13','localhost:8080/gas/static/img/picture/1590934064829_11.jpg'),(21,'1591002554256_dafg.jpeg','头像14','localhost:8080/gas/static/img/picture/1591002554256_dafg.jpeg');

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(30) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  `position` varchar(10) DEFAULT '操作员',
  `upicture` varchar(70) DEFAULT 'localhost:8080/gas/static/img/picture/a5.jpg',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`id`,`username`,`password`,`position`,`upicture`) values (2,'admin','admin','管理员','localhost:8080/gas/static/img/picture/a5.jpg'),(3,'lisi','lisi','操作员','localhost:8080/gas/static/img/picture/a2.jpg'),(4,'fangyuan','fangyuan','管理员','localhost:8080/gas/static/img/picture/a3.jpg'),(8,'root','root','管理员','localhost:8080/gas/static/img/picture/a4.jpg'),(9,'123','123','操作员','localhost:8080/gas/static/img/picture/a6.jpg'),(10,'wangpeiyi','wangpeiyi','管理员','localhost:8080/gas/static/img/picture/a5.jpg'),(12,'wangwu','wangwu','管理员','localhost:8080/gas/static/img/picture/a6.jpg'),(13,'qwe','qwe','管理员','localhost:8080/gas/static/img/picture/a5.jpg'),(15,'qqq','qqq','管理员','localhost:8080/gas/static/img/picture/a5.jpg');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
